# Intro

In [49]:
!pip install db-sqlite3

Requirement already satisfied: db-sqlite3 in /usr/local/lib/python3.7/dist-packages (0.0.1)
Requirement already satisfied: db in /usr/local/lib/python3.7/dist-packages (from db-sqlite3) (0.1.1)
Requirement already satisfied: antiorm in /usr/local/lib/python3.7/dist-packages (from db->db-sqlite3) (1.2.1)

In [50]:
import pandas as pd
import sqlite3
from datetime import date

In [51]:
#connecting with the database.
db = sqlite3.connect("testing.db")
db.execute("drop table if exists results")
try:
  db.execute("create table results(Name text, Date datetime, Mobile text,Mail text)")
except:
  print("Already table existed !!")

In [52]:
db = sqlite3.connect("testing.db")

In [53]:
Date = date.today().strftime("%d-%m-%Y")
Name = "TestDemo"
Mobile = "9000011101"
Mail = "teachineMachine1@you.com"

In [54]:
cmd = "insert into results(Name, Mobile,Date,Mail) values('{}','{}','{}','{}')".format(Name,Mobile,Date,Mail)
db.execute(cmd)
db.commit()

# Querying

### Type - 1 Querying

In [55]:
db = sqlite3.connect("testing.db")
rs = db.execute('SELECT * FROM results')

for row in rs:
    print (row)

('TestDemo', '29-05-2021', '9000011101', 'teachineMachine1@you.com')

### Type - 2 Querying

In [56]:
db = sqlite3.connect("testing.db")

qry = """

SELECT * FROM results

"""
df = pd.read_sql_query(qry, db)
df.head()

       Name        Date      Mobile                      Mail
0  TestDemo  29-05-2021  9000011101  teachineMachine1@you.com

# Batch-wise data storage

In [57]:

def pushtoDB(Name,Mobile,Mail):
#inserting values inside the created table
    db = sqlite3.connect("testing.db")    
    from datetime import date
    Date = date.today().strftime("%d-%m-%Y")
    cmd = "insert into results(Name, Mobile,Date,Mail) values('{}','{}','{}','{}')".format(Name,Mobile,Date,Mail)
    db.execute(cmd)
    db.commit()

/content/dummy.csv

In [58]:
data = pd.read_csv("dummy.csv")   
data.head()
#data.shape

         Name        Date      Mobile                      Mail
100  TestDemo  29-05-2021  9000011101  teachineMachine1@you.com
101     *****  29-05-2021   123456789          Machine1@you.com
102     *****  29-05-2021   123456789          Machine2@you.com
103     *****  29-05-2021   123456789          Machine3@you.com
104     *****  29-05-2021   123456789          Machine4@you.com

In [59]:
pushtoDB("Testttt","121","2112")

In [60]:
data.tail()

      Name        Date     Mobile              Mail
103  *****  29-05-2021  123456789  Machine3@you.com
104  *****  29-05-2021  123456789  Machine4@you.com
105  *****  29-05-2021  123456789  Machine5@you.com
106  *****  29-05-2021  123456789  Machine6@you.com
107  *****  29-05-2021  123456789  Machine7@you.com

In [61]:
db = sqlite3.connect("testing.db")
qry = "SELECT * FROM results"
df = pd.read_sql_query(qry, db)
df.head()

       Name        Date      Mobile                      Mail
0  TestDemo  29-05-2021  9000011101  teachineMachine1@you.com
1   Testttt  29-05-2021         121                      2112

In [62]:
data

         Name        Date      Mobile                      Mail
100  TestDemo  29-05-2021  9000011101  teachineMachine1@you.com
101     *****  29-05-2021   123456789          Machine1@you.com
102     *****  29-05-2021   123456789          Machine2@you.com
103     *****  29-05-2021   123456789          Machine3@you.com
104     *****  29-05-2021   123456789          Machine4@you.com
105     *****  29-05-2021   123456789          Machine5@you.com
106     *****  29-05-2021   123456789          Machine6@you.com
107     *****  29-05-2021   123456789          Machine7@you.com

In [63]:
len(data)

8

In [64]:
data.iloc[1][3]

'Machine1@you.com'

In [65]:
for i in range(0,len(data)):
  pushtoDB(data.iloc[i][0],data.iloc[i][2],data.iloc[i][3])

In [66]:
db = sqlite3.connect("testing.db")
qry = """

SELECT * FROM results 

"""
df = pd.read_sql_query(qry, db)
df

       Name        Date      Mobile                      Mail
0  TestDemo  29-05-2021  9000011101  teachineMachine1@you.com
1   Testttt  29-05-2021         121                      2112
2  TestDemo  29-05-2021  9000011101  teachineMachine1@you.com
3     *****  29-05-2021   123456789          Machine1@you.com
4     *****  29-05-2021   123456789          Machine2@you.com
5     *****  29-05-2021   123456789          Machine3@you.com
6     *****  29-05-2021   123456789          Machine4@you.com
7     *****  29-05-2021   123456789          Machine5@you.com
8     *****  29-05-2021   123456789          Machine6@you.com
9     *****  29-05-2021   123456789          Machine7@you.com

In [67]:
db = sqlite3.connect("testing.db")
qry = """

SELECT * FROM results WHERE Mobile = "123456789"

"""
df = pd.read_sql_query(qry, db)
df.head()

    Name        Date     Mobile              Mail
0  *****  29-05-2021  123456789  Machine1@you.com
1  *****  29-05-2021  123456789  Machine2@you.com
2  *****  29-05-2021  123456789  Machine3@you.com
3  *****  29-05-2021  123456789  Machine4@you.com
4  *****  29-05-2021  123456789  Machine5@you.com

#Lab 
ทดลองเรียกข้อมูลที่ Mail = Machine4@you.com